import asyncio
import os
import sys
print(os.path.dirname(os.path.dirname(os.path.dirname(os.path.dirname(os.path.dirname(os.path.abspath(__file__)))))))
sys.path.append(os.path.dirname(os.path.dirname(os.path.dirname(os.path.dirname(os.path.dirname(os.path.abspath(__file__)))))))
from app.agent.data_analysis import DataAnalysis
from app.logger import logger


prefix = "Help me generate charts and save them locally, specifically:"
tasks = [
    {
        "prompt": "Help me show the daily sales performance metrics over time. ",
        "data":
            """Table: 每日销售数据明细​
            OrderDate,RegionCode,SalesAmount,DataQuality
            2023-04-01,SW,25860.24,正常
            2023-04-01,NE,5877.65,正常
            2023-04-01,C,34271.58,正常
            2023-04-01,N,6251.42,正常
            2023-04-01,E,3113.46,正常
            2023-04-02,NW,87717.84,正常
            2023-04-02,E,53058.96,正常
            2023-04-02,N,14409.92,正常
            2023-04-02,NE,5540.92,正常
            2023-04-03,C,41802.49,正常
            2023-04-03,NE,9202.20,正常
            2023-04-03,SW,583.30,正常
            2023-04-03,N,560.56,正常
            2023-04-03,E,96269.32,正常
            2023-04-04,NE,106208.48,正常
            2023-04-04,C,6231.62,正常
            2023-04-04,E,84454.83,正常
            2023-04-05,NE,312.82,正常
            2023-04-05,SW,5718.89,正常
            2023-04-05,C,39811.91,正常
            2023-04-05,E,244163.47,正常
            2023-04-05,N,79487.41,正常
            2023-04-06,C,28648.34,正常
            2023-04-06,N,18288.76,正常
            2023-04-08,SW,67434.58,正常
            2023-04-08,C,1176.00,正常
            2023-04-08,NW,81264.54,正常
            2023-04-08,E,87750.96,正常
            2023-04-09,SW,67434.58,正常
            2023-04-09,C,5902.34,正常
            2023-04-09,E,22252.27,正常
            2023-04-09,NE,98844.76,正常
            2023-04-10,E,2677.36,正常
            2023-04-10,SW,1444.52,正常
            2023-04-10,NE,62082.61,正常
            2023-04-10,C,677.38,正常
            2023-04-11,SW,776.16,正常
            2023-04-11,C,7487.00,正常
            2023-04-11,E,57016.40,正常
            2023-04-12,SW,7131.85,正常
            2023-04-12,E,11837.81,正常
            2023-04-12,C,207763.14,正常
            2023-04-13,C,24299.30,正常
            2023-04-13,E,9847.04,正常
            2023-04-13,NE,15919.12,正常
            2023-04-15,SW,33544.42,正常
            2023-04-15,C,39935.98,正常
            2023-04-15,N,60416.80,正常
            2023-04-15,NE,1234.80,正常
            2023-04-15,E,36007.16,正常
            2023-04-16,E,108484.04,正常
            2023-04-16,SW,2450.00,正常
            2023-04-17,E,78099.14,正常
            2023-04-17,C,49350.84,正常
            2023-04-17,N,18480.84,正常
            2023-04-18,NE,48419.84,正常
            2023-04-18,C,118951.67,正常
            2023-04-18,N,10853.89,正常
            2023-04-18,SW,1627.58,正常
            2023-04-18,E,32777.28,正常
            2023-04-19,N,41905.78,正常
            2023-04-19,E,47942.58,正常
            2023-04-19,NE,48259.51,正常
            2023-04-19,C,18021.22,正常
            2023-04-22,NE,58530.50,正常
            2023-04-22,E,22004.72,正常
            2023-04-22,C,7729.26,正常
            2023-04-23,E,49218.54,正常
            2023-04-23,NE,13944.42,正常
            2023-04-23,SW,3843.56,正常
            2023-04-24,SW,16754.08,正常
            2023-04-24,NE,2343.18,正常
            2023-04-24,E,41413.82,正常
            2023-04-24,C,723.24,正常
            2023-04-25,C,10678.08,正常
            2023-04-25,E,44791.10,正常"""
    }
]


async def main():
    for index, item in enumerate(tasks):
        logger.info(f"Begin task {index} / {len(tasks)}!")
        agent = DataAnalysis()
        await agent.run(
            f"{prefix},chart_description:{item['prompt']},Data:{item['data']}"
        )
        logger.info(f"Finish with {item['prompt']}")


if __name__ == "__main__":
    asyncio.run(main())
